src/cf/Documents/CRM_ЭтапКалендарногоПлана.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>CRM_ЭтапКалендарногоПлана</Name>
			<BasedOn>
				<xr:Item>Catalog.Проекты</xr:Item>
				<xr:Item>Catalog.CRM_ЭтапыПроектов</xr:Item>
				<xr:Item>Document.CRM_Мероприятие</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесНаправление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.CRM_БизнесПроцесс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийЭтап</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_ЭтапКалендарногоПлана</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>Дата закрытия </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Comment>Длительность этапа в днях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_КартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Свободное описание этапа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Comment>Описание результата этапа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>Состояние этапа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыЭтаповКалендарногоПлана</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Comment>Название этапа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭтапа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ТипыЭтапов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельЭтапа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МоделиЭтапов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапПредок</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_ЭтапКалендарногоПлана</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесРегион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПользователиЭтапа</Name>
					<Comment>Участники и ответственные по этапу</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Comment>Признак ответственного за этап</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Смещения</Name>
					<Comment>История смещения сроков КТ</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СмещениеДатаНачало</Name>
							<Comment>История смещенной даты</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СмещениеДатаОкончание</Name>
							<Comment>История смещений даты</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Comment>обязателен для заполнения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Comment>Автор изменения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/вогПартнерыПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогПартнерыПроектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_ЭтапКалендарногоПлана</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/CRM_ЭтапКалендарногоПлана/Forms/ФормаСозданияЭтапа/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("МодельКейса") Тогда
		МодельКейса = Параметры.МодельКейса;
	КонецЕсли;
	Элементы.Проект.ПодсказкаВвода = Строка(МодельКейса);
	
	Если Параметры.Свойство("МассивКлиентов") Тогда
		Для каждого Клиент Из Параметры.МассивКлиентов Цикл
			СтрокаТЧ = ТаблицаКлиентов.Добавить();
			Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Партнеры") Тогда
				СтрокаТЧ.Партнер = Клиент;
			ИначеЕсли ТипЗнч(Клиент) = Тип("СправочникСсылка.вогТорговыеТочки") Тогда
				СтрокаТЧ.ТорговаяТочка = Клиент;
				СтрокаТЧ.Партнер 	   = Клиент.Партнер;
				
			КонецЕсли;
			
		КонецЦикла;	
	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТаблицаКлиентов.Количество() > 0 Тогда
		Для каждого СтрокаТЧ Из ТаблицаКлиентов Цикл
			Менеджер = РегистрыСведений.вогПартнерыПроектов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Менеджер, СтрокаТЧ);
			
			Менеджер.Проект = Объект.Проект;
			Менеджер.Этап   = Объект.Ссылка;
			
			Менеджер.Записать();
			
		КонецЦикла;
	
	КонецЕсли;
	
	//Добавление этапа
	CRM_УправлениеПроектамиСервер.ДобавитьЭтапКонтрольнуюТочкуВКейс(Объект.Проект, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ОткрытьЭтап Тогда
		ОткрытьФорму("Документ.CRM_ЭтапКалендарногоПлана.ФормаОбъекта",
			Новый Структура("Ключ", Объект.Ссылка));
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора"       , Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("CRM_ЭтоКейс"       , Истина);
	
	Если ЗначениеЗаполнено(МодельКейса) Тогда
		ПараметрыФормы.Вставить("МодельКейса", МодельКейса);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Проекты.Форма.CRM_ФормаСпискаКейсы", 
		ПараметрыФормы, Элемент, УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура БизнесРегионПриИзменении(Элемент)
	СформироватьНаименование();	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	СформироватьНаименование();	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗакрытияПриИзменении(Элемент)
	СформироватьНаименование();	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура СформироватьНаименование()
	
	ТекстНаименования = НСтр("ru = '%МодельКейса% - %БизнесРегион%: (%НачалоПериода% - %КонецПериода%)'");
	ТекстНаименования = СтрЗаменить(ТекстНаименования, "%МодельКейса%" , СокрЛП(МодельКейса));
	ТекстНаименования = СтрЗаменить(ТекстНаименования, "%БизнесРегион%", СокрЛП(Строка(Объект.БизнесРегион)));
	ТекстНаименования = СтрЗаменить(ТекстНаименования, "%НачалоПериода%", СокрЛП(Строка(Формат(Объект.Дата, "ДФ=dd.MM.yyyy"))));
	ТекстНаименования = СтрЗаменить(ТекстНаименования, "%КонецПериода%", СокрЛП(Строка(Формат(Объект.ДатаЗакрытия, "ДФ=dd.MM.yyyy"))));
	
	Объект.Тема = ТекстНаименования;
	
КонецПроцедуры // СформироватьНаименование()

#КонецОбласти
